Documents/ОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОказаниеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бонусы</xr:Item>
				<xr:Item>AccumulationRegister.ПродажаУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID_Визита_YClients</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID_Транзакции_YClients</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОказаниеУслуг/Ext/ManagerModule.bsl
Функция ТаблицаДляПроведения(Ссылка, Период, Отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Услуги.Номенклатура КАК Номенклатура,
	|	Услуги.Количество КАК Количество,
	|	Услуги.Сумма КАК Сумма,
	|	&Ссылка КАК Ссылка,
	|	&Период КАК Период,
	|	&Мастер КАК Мастер,
	|	Услуги.Ссылка.СуммаНачисления КАК Бонусы,
	|	&Клиент КАК Клиент,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|	ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ОказаниеУслуг.Услуги КАК Услуги
	|ГДЕ
	| Услуги.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ	Клиент, Бонусы КАК Количество, ВидДвижения, Период ИЗ ВТ_Данные
	|;
	|ВЫБРАТЬ	Клиент, Номенклатура, Мастер, Количество, Сумма, Период ИЗ ВТ_Данные
	| УПОРЯДОЧИТЬ ПО Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Мастер", Ссылка.Мастер);
	Запрос.УстановитьПараметр("Клиент", Ссылка.Клиент);
	Запрос.УстановитьПараметр("Период", Период);
	Пакет = Запрос.ВыполнитьПакет();
	РезультатСтруктура = Новый Структура;
	РезультатСтруктура.Вставить("Бонусы", Пакет[1].Выгрузить());
	РезультатСтруктура.Вставить("ПродажаУслуг", Пакет[2].Выгрузить());
	Возврат РезультатСтруктура;
КонецФункции
